[
    {
        "Name": " Material Research Science Society",
        "Description": null,
        "Summary": "N/a",
        "CategoryNames": [
            "Graduate Student Organizations"
        ]
    },
    {
        "Name": "180 Degrees Consulting",
        "Description": "<table width=\"0\">\r\n<tbody>\r\n<tr>\r\n<td>\r\n<p>The mission of 180 Degrees Consulting, UMass Amherst is to provide non-profit organizations with high quality consulting services in order to have a greater social impact on vulnerable communities. 180 Degrees Consulting, UMass Amherst will work on projects to develop lasting solutions for organizations facing difficulties. Examples of such projects include developing website platforms or assisting in social media marketing campaigns. As an organization, we will go through professional development training, engage in case competitions, host case competitions, and collaborate with other branches. <br /><br />180 Degrees Consulting, UMass Amherst intends to help team members from all majors on campus gain valuable skills which can be applied to future career opportunities. Team members will be able to grow as professionals while helping non-profit organizations better serve the causes they were established for. 180 Degrees Consulting, UMass Amherst values diversity and being able to bring together students of various majors who offer unique perspectives and ideas.</p>\r\n</td>\r\n</tr>\r\n</tbody>\r\n</table>",
        "Summary": "180 Degrees Consulting is a student-run consulting group for non-profits and social enterprises.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "3D Printing Club",
        "Description": "<p>Join our Discord for up-to-date information:&nbsp;<a href=\"https://discord.gg/vYD8hc8bKS\">https://discord.gg/vYD8hc8bKS</a>!&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">3D Printing Club is a diverse group of enthusiasts seeking to explore the world of 3D printing. We seek to build 3D printers, experiment with printing materials, and delve into the world of 3D design! 3D printing is used in art, entertainment, manufacturing, and more. We want to foster a welcoming community where members can connect, brainstorm, and explore this wonderful technology.&nbsp;</span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">The 3D Printing Club will run a variety of club-wide activities, projects, and events like 3D printing workshops, 3D printer build/repair sessions, and 3D modeling tutorials. We will also run events open to all UMass students where they can try out a 3D printer for the first time (under supervision). </span></p>",
        "Summary": "3D Printing Club is a diverse group of enthusiasts seeking to explore the world of 3D printing. We seek to build 3D printers, experiment with printing materials, and delve into the world of 3D design!",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "AALANAI Honor Society",
        "Description": "<p>The mission of the African American Latin(a/o) Asian Native American International Honor Society is to ensure that its members are prepared to meet the many challenges they will encounter in college, and throughout their lives. Our goal is to improve the retention and graduation rate of all AALANAI students. Our objectives are to reward dedicated AALANAI students by recognizing their outstanding scholastic achievements, and to encourage AALANAI students to continue with their educational pursuits well beyond their undergraduate studies. The AALANAI Honor Society is here to provide support to all our very diverse members. The society works closely with members of the U.S Department of Education and alumni.</p>",
        "Summary": "The AALANAI Honor Society's mission is to ensure that its members are prepared to meet the many challenges they will encounter navigating through college and life. Our goal is to improve the retention and graduation rate of students of diverse backgrounds",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "Academic Club Council",
        "Description": "<p>The Academic Council meets monthly to attend workshops, receive trainings, and stay up-to-date on RSO requirements.&nbsp;</p>",
        "Summary": "This is the Council for all academic RSOs at UMass. ",
        "CategoryNames": [
            "Academic Council"
        ]
    },
    {
        "Name": "Accounting Association",
        "Description": "<p>Our goal is to give students the tools, information, and resources required to prepare for a successful career. All majors&nbsp;are welcomed and encouraged to come&nbsp;and learn more about the industry. We have weekly meetings that run from 7:30 PM to 8:30 PM on Tuesdays in Isenberg 120. To get on our mailing list please email us <span style=\"text-decoration: underline;\"> accountingassociasion.umass@gmail.com</span> :)&nbsp;</p>\r\n<p>&nbsp;</p>",
        "Summary": "The UMass Accounting Association is a Registered Student Organization at the University of Massachusetts Amherst. Our goal is to give interested students information and resources to prepare for a successful career in the accounting industry. ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "Active Minds",
        "Description": "<p>Active Minds is a national organization that empowers students to speak openly about mental health in order to educate others and encourage help-seeking.&nbsp; We are changing the culture on campuses and in the community by providing information, leadership opportunities and advocacy training to the next generation.<br /><br />By developing and supporting chapters of a student-run mental health awareness, education, and advocacy group on campuses nationwide, the nonprofit organization works to increase students&rsquo; awareness of mental health issues, provide information and resources regarding mental health and mental illness, encourage students to seek help as soon as it is needed, and serve as liaison between students and the mental health community.</p>\r\n<p>Through campus-wide events and national programs, Active Minds aims to remove the stigma that surrounds mental health issues and create a comfortable environment for open conversation about mental health issues on campuses nationwide.</p>\r\n<p>Follow our Instagram @umassactiveminds and please email us at umassactiveminds@gmail.com to join our email list!</p>",
        "Summary": "Active Minds strives to change the conversation about mental health by reducing stigma through student participation. In facilitating dialogue and community awareness we hope to show the importance of mental well-being for the individual and community.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Advocacy Council"
        ]
    },
    {
        "Name": "Actively Moving Forward",
        "Description": null,
        "Summary": "Actively Moving Forward (AMF) is an organization dedicated to supporting college students grieving the illness or death of a loved one through service groups and a peer-led support group.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Service & Engagement Council"
        ]
    },
    {
        "Name": "Actuary Club",
        "Description": "<p><span style=\"font-size: 15px; font-family: 'Times New Roman'; color: #000000; background-color: transparent; font-weight: normal; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline;\">The Actuary Club has been re-branded as a chapter of Gamma Iota Sigma. Please see our new campus pulse page: https://umassamherst.collegiatelink.net/organization/GIS<br /> </span></p>\r\n<p>&nbsp;</p>\r\n<p><span id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_internal-source-marker_0.8886820443846339\" style=\"font-size: 15px; font-family: 'Times New Roman'; color: #000000; background-color: transparent; font-weight: normal; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline;\">The UMass Actuary Club encourages community, collaboration, and communication among all students with an interest in, or curiosity about, Actuarial Science. &nbsp;</span></p>\r\n<p><span id=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_internal-source-marker_0.8886820443846339\" style=\"font-size: 15px; font-family: 'Times New Roman'; color: #000000; background-color: transparent; font-weight: normal; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline;\">The club seeks to enrich the entire student body through providing professional-development opportunities, skill-building workshops, and other collaborative efforts with student organizations. Our focus is on not only involving students on campus, but also local professionals. The club always welcomes any interested party and promotes a friendly and positive environment for personal and professional growth.</span></p>\r\n<p><span style=\"font-size: 15px; font-family: 'Times New Roman'; color: #000000; background-color: transparent; font-weight: normal; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline;\"><a href=\"https://www.facebook.com/groups/473223739377933/\" target=\"_blank\">Facebook Group</a></span></p>",
        "Summary": "The Actuary Club has been re-branded as a chapter of Gamma Iota Sigma. Please see our new campus pulse page: https://umassamherst.collegiatelink.net/organization/GIS\r\n",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "Adopted Student Advisory Panel (ASAP)",
        "Description": "<p><span id=\"x_x_x_t0laGFailbkMXnin\">ASAP strives to provide a safe space for adoptees in the Five College Consortium to socialize and share their experiences. Through general meetings and events, volunteering, and panel discussions, our goal is to advise and support those in the adoptee community, especially during the difficult transition to college. We also welcome non-adoptees who are interested in learning about adoption or in supporting our community.&nbsp;</span></p>",
        "Summary": "ASAP's mission is to advise and best support those who are adopted and their families. We engage in adoption-related advocacy and meet to talk to one another about our experiences as adoptees.   ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Advocacy Council"
        ]
    },
    {
        "Name": "Advancement of Diversity in Business",
        "Description": "<p><span style=\"font-weight: 400;\">The Advancement of Diversity in Business aims to provide students from diverse and underrepresented backgrounds with step-by-step guidelines and knowledge on how to excel in business in order to propel them into their careers. We aim to cultivate an environment that will inspire our members to develop a mindset that drives creation, motivation, and excellence in their everyday lives. In order to achieve our goals, ADB hosts events such as diversity panels to share experiences and promote discussion, social events to build community, and companies such as Ernst and Young (EY) and PricewaterhouseCoopers (PwC) to engage with our members and help them get a head start in building their professional network. Through these events and our mission statement, ADB strives to build a strong community amongst Isenberg and the wider UMass community.&nbsp;</span></p>\r\n<p><br /><br /></p>",
        "Summary": "RSO",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "Advancing Democracy",
        "Description": null,
        "Summary": "TBA",
        "CategoryNames": [
            "Registered Student Organizations",
            "Advocacy Council"
        ]
    },
    {
        "Name": "Adventist Christian Fellowship",
        "Description": "<p>ACF&nbsp;is a diverse multicultural group of Seventh-day Adventist Christian students who are seeking to live out what they learn from the Bible and to help others know the truth about Jesus Christ. Activities include weekly Bible studies, social gatherings, and community service work, all of which are open to students from all faiths. The purpose of ACF&nbsp;is to provide an environment for students to fellowship and build community at the five colleges in the area.&nbsp;Our diversity is remarkable- drawing students from all five colleges in the valley. As students, we believe in spiritual and academic excellence, and we welcome and encourage students/individuals from the broader college community to join us. You would definitely be at home and get that sense of belonging in the ACF&nbsp;family!</p>\r\n<p>&nbsp;</p>",
        "Summary": "ACF is a loving Seventh-Day Adventist Bible based community open to all people interested in fellowship. The organization provides a platform for individuals to experience vibrant spiritual growth, meet new people, and help in the nearby communities.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Religious & Spiritual Council"
        ]
    },
    {
        "Name": "Advocacy, Inclusion and Support Programs",
        "Description": "<p>Inclusion and support for students includes enhancing services for underrepresented students and creating intersectional partnerships among our support programs. Visit the Student Life website to learn more at&nbsp;<a href=\"https://www.umass.edu/studentlife/advocacy-inclusion-support\">https://www.umass.edu/studentlife/advocacy-inclusion-support.</a></p>",
        "Summary": "Inclusion and support for students includes enhancing services for underrepresented students and creating intersectional partnerships among our support programs.",
        "CategoryNames": []
    },
    {
        "Name": "AERA Student Organization (UMass Chapter)",
        "Description": null,
        "Summary": "GSO",
        "CategoryNames": [
            "Graduate Student Organizations"
        ]
    },
    {
        "Name": "African Graduate and Scholars Association",
        "Description": null,
        "Summary": "AGASA serves as a focal point for rallying graduate students and scholars on issues and concerns pertinent to the continent of Africa and a vehicle to create greater visibility of the interests of African Students.\r\n\r\nhttp://www.umass.edu/gso/agasa/",
        "CategoryNames": [
            "Graduate Student Organizations"
        ]
    },
    {
        "Name": "African Student Association",
        "Description": "<p>The African Student Association (ASA) is a cultural RSO that values all cultures and traditions. Our establishment is based at the University of Massachusetts Amherst.</p>\r\n<p>The organization is made up of a very strong and productive executive board whose purpose is to project the African culture to the eyes of the public. Our second purpose is to in turn learn from all other cultures in efforts to promote unity and diversity.</p>\r\n<p>In the past, we have hosted comedy shows, potluck dinners, field trips, and our widely known cultural nights. In doing so, we aim to create inclusive learning and sharing environment for culture. We are always looking for those with talent (dancers, singers, comedians, actors, poets, fashionists, etc.) to contribute to our events.</p>\r\n<p>ASA is very active, so we welcome everyone from all backgrounds to join us and have fun!</p>",
        "Summary": "The African Student Association (ASA) is a cultural RSO that values all cultures and traditions. Our establishment is based in the University of Massachusetts Amherst.\r\nThe organization its made up of a very strong and productive",
        "CategoryNames": [
            "Registered Student Organizations",
            "Cultural Council",
            "Cultural Council-Kenna"
        ]
    },
    {
        "Name": "Afro-American Studies Graduate Council",
        "Description": "<p>The Afro-American Studies Graduate Council (AAGC) is a non-hierarchical student<br />organization of graduate students in the W.E.B. Du Bois Afro-American Studies<br />Department. The AAGC seeks to promote professional development and a network of<br />support for our peers, and advocate for the Afro-American Studies department, its<br />students, and marginalized communities on the University of Massachusetts Amherst<br />Campus.</p>\r\n<p><span style=\"font-weight: 400;\">The AAGC aims to be a vehicle for social justice and Diversity, Equity, and Inclusion advocacy in the W.E.B. Du Bois Department of Afro-American Studies, the University of Massachusetts campus</span><em><span style=\"font-weight: 400;\">, </span></em><span style=\"font-weight: 400;\">and the broader Western Massachusetts community.</span></p>",
        "Summary": "The Afro-American Studies Graduate Council (AAGC) is a non-hierarchical student\r\norganization of graduate students in the W.E.B. Du Bois Afro-American Studies\r\nDepartment.",
        "CategoryNames": [
            "Graduate Student Organizations"
        ]
    },
    {
        "Name": "Alana Caucus",
        "Description": "<p>To be added soon.</p>",
        "Summary": "To be added soon.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Student Government Organizations"
        ]
    },
    {
        "Name": "Albanian Student Association",
        "Description": null,
        "Summary": "n/a",
        "CategoryNames": [
            "Registered Student Organizations",
            "Cultural Council"
        ]
    },
    {
        "Name": "Albanian Student Union ",
        "Description": null,
        "Summary": "The purpose of this organization is to promote Albanian culture within the UMass campus.  We are looking to establish a sense of community  that will bring Albanian students together and educate those interested Albanian culture. ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Cultural Council"
        ]
    },
    {
        "Name": "Alive With Dance",
        "Description": "<p class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_p1\">Alive With Dance is an RSO that shares the art of dance with the UMass community. We offer performance opportunities for students to work with emerging student choreographers in a student-run dance concert held in the fall. We also provide open weekend dance classes for all levels of experience in Totman Gymnasium taught by the school&rsquo;s dance majors and other dance-related service opportunities.</p>",
        "Summary": "Alive With Dance is an RSO that shares the art of dance with the UMass community through performances, classes, and dance service.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Arts & Media Council"
        ]
    },
    {
        "Name": "Alliance for Afro-American Cultural Education",
        "Description": "<p>The Alliance for Afro-American Cultural Education is committed to promoting awareness of the rich history and cultural traditions of Afro-Americans, the descenda<span class=\"x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_x_text_exposed_show\">nts of the various African ethnic groups who arrived in the United States during the colonial and/or enslavement periods (traditionally located in the Southeastern U.S., or \"Black Belt\" states).<br /><br />We are committed to promoting the pursuit of Afro-American Studies by providing exciting and innovative opportunities to learn about and celebrate Afro-American culture, outside of the classroom. AACE also provides an avenue for students in the W.E.B. DuBois Department of Afro-American Studies to network and learn from one another. We encourage students of Afro-American heritage, all Afro-American Studies majors and minors, and any other interested students to get involved! All are welcome.<br /><br />We aim to spearhead and support efforts toward the recruitment and retention of Afro-American students to UMass Amherst and the 5-College Consortium, especially those students from local urban communities like Springfield, MA.</span></p>",
        "Summary": "The Alliance for Afro-American Cultural Education is an organization committed to promoting awareness of Afro-American culture and history among students of all cultural and academic backgrounds. ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Cultural Council"
        ]
    },
    {
        "Name": "Alliance for Community Transformation",
        "Description": null,
        "Summary": "TBA",
        "CategoryNames": [
            "Registered Student Organizations",
            "Advocacy Council"
        ]
    },
    {
        "Name": "Alpha Chi Omega",
        "Description": "<p>The Delta Mu chapter of Alpha Chi Omega at the University of Massachusetts is a group of real, strong, motivated young women. We strive for character growth through friendship, learning, leadership, and service. Passionate about our&nbsp;philanthropy, Domestic Violence Awareness, each semester we fundraise to bring awareness to our philanthropic cause. Involving and engaging participation from the UMass and town of Amherst community is something we strive for. We are always looking for great women to be a part of our chapter. Please feel free to contact us!</p>\r\n<p>Check us out on:</p>\r\n<p>Instagram ~ @axoatumass</p>\r\n<p>Tik Tok ~ @axoumass</p>",
        "Summary": "Alpha Chi Omega is an organization about you: unique, talented, and genuine young women looking for a fun and meaningful way to enhance the college experience.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Panhellenic Council",
            "Greek Life - Sorority"
        ]
    },
    {
        "Name": "Alpha Chi Rho",
        "Description": "<p>Alpha Chi Rho UMass, originally founded 1987 and rechartered in 2017, is a fraternity that commits itself to the development of young men socially, academically, and morally. We have members engaged in many leadership roles on campus, including clubs, honors societies, SGA, and IFC. If you are looking to go greek, this is the place for you.</p>\r\n<p>Rush Crow!</p>\r\n<p>Please visit&nbsp;our <a href=\"https://www.instagram.com/axpumass/?hl=en\">Instagram</a>&nbsp;for more information.</p>\r\n<p>&nbsp;</p>",
        "Summary": "Phi Rho Chi chapter of the National Fraternity of Alpha Chi Rho.\r\n\r\n",
        "CategoryNames": [
            "Registered Student Organizations",
            "Interfraternity Council",
            "Greek Life - Fraternity "
        ]
    },
    {
        "Name": "Alpha Epsilon Phi",
        "Description": "<p><strong>2024 Executive Board</strong></p>\r\n<p><em>President: </em>Caroline Coyle</p>\r\n<p><em>VP Operations:&nbsp;</em>Carly Sperber</p>\r\n<p><em>VP Finance: </em>Vixie Stevens</p>\r\n<p><em>VP Social Standards: </em>Ally Donovan</p>\r\n<p><em>VP Programming:&nbsp;</em>Jenni Crell</p>\r\n<p><em>VP Recruitment:&nbsp;</em>Catey Johnson</p>\r\n<p><em>VP New Member Education: </em>Cat Fitzsimmons</p>\r\n<p><em>VP Social Responsibility:&nbsp;</em>Carolyn Medwar</p>\r\n<p><em>VP Philanthropy:&nbsp;</em>Lilly Horgan</p>\r\n<p><em>VP Scholarship:&nbsp;</em>Sarah Villa</p>\r\n<p><em>VP Panhellenic</em>: Ally Brass</p>",
        "Summary": "The mission of Alpha Epsilon Phi Sorority is to inspire and support exemplary women dedicated to friendship and a lifelong commitment to Alpha Epsilon Phi while building on the vision of our Jewish founders.\r\n-- February 1996",
        "CategoryNames": [
            "Registered Student Organizations",
            "Panhellenic Council",
            "Greek Life - Sorority"
        ]
    },
    {
        "Name": "Alpha Kappa Alpha Sorority, Incorporated",
        "Description": "<p>Founded on the campus of Howard University in Washington, DC in 1908, <span style=\"color: #f08080;\"> Alpha Kappa </span><span style=\"color: #f08080;\">Alpha Sorority Incorporated </span> is the oldest greek-letter organization established by African American college-trained women. Currently 115 years old, <span style=\"color: #008000;\">Alpha Kappa </span><span style=\"color: #008000;\">Alpha Sorority Incorporated</span> continues to create change and impact in history. <span style=\"color: #f08080;\">Alpha Kappa Alpha Sorority</span> was incoporated on January 29, 1913. The Rho Kappa Chapter of<span style=\"color: #008000;\"> Alpha Kappa Alpha Sorority </span>was chartered on April 30, 1995 at the University of Massachusetts Amherst. Since its establishment over a century ago, <span style=\"color: #f08080;\">Alpha Kappa </span><span style=\"color: #f08080;\">Alpha Sorority Incorporated</span> helps to improve social and economic conditions through community service programs. The sorority works with communites through service initiatives and progressive programs relating to education, family, health and business. <span style=\"color: #008000;\"> Alpha Kappa Alpha</span> is apart of the National Pan-Hellnic Council.</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"color: #f08080;\">Founded: <span style=\"color: #008000;\">January 15, 1908 Howard University Washington DC</span></span></p>\r\n<p><span style=\"color: #f08080;\">Motto: <span style=\"color: #008000;\">\"By Merit and Culture\" </span></span></p>\r\n<p><span style=\"color: #f08080;\">Colors: <span style=\"color: #008000;\">Salmon Pink <span style=\"color: #f08080;\"> and <span style=\"color: #008000;\">Apple Green </span></span></span></span></p>\r\n<p><span style=\"color: #f08080;\">Flower: <span style=\"color: #008000;\">Pink Tea Rose</span></span></p>\r\n<p><span style=\"color: #f08080;\">Symbol: <span style=\"color: #008000;\">Ivy Leaf</span></span></p>\r\n<p>&nbsp;</p>\r\n<p><a href=\"https://instagram.com/rhokappa_1908?igshid=YmMyMTA2M2Y=\">Rho Kappa Instagram Page</a></p>",
        "Summary": "Founded on the campus of Howard University in Washington, DC in 1908 Alpha Kappa Alpha Sorority Incorporated is the oldest greek-letter organization established by African American college-trained women. The Rho Kappa chapter represents the UMass branch.",
        "CategoryNames": [
            "Registered Student Organizations",
            "National Pan-Hellenic Council",
            "Greek Life - Sorority"
        ]
    },
    {
        "Name": "alpha Kappa Delta Phi",
        "Description": "<p><span style=\"font-weight: 400;\">We seek to promote Asian-awareness and to better our communities both on and off-campus. We aim to lend a voice to those who have been marginalized through promoting personal growth in various aspects such as scholarship and leadership. We strive to utilize the words of this document to progress and advance ourselves as an organization and as individuals. Thus, the members of aKDPhi hereby establish our constitution at the University of Massachusetts at Amherst.</span></p>",
        "Summary": "alpha Kappa Delta Phi Sorority",
        "CategoryNames": [
            "Registered Student Organizations",
            "Multicultural Greek Council",
            "Greek Life - Sorority"
        ]
    },
    {
        "Name": "Alpha Omega Ministry",
        "Description": "<p><span style=\"font-weight: 400;\">Like the Bereans in Acts 17, we love to examine the Bible to know if the things we have heard about God are true and trustworthy. To this end we hold open discussions, called bible talks, that aim to enrich understanding of Christianity among faculty and students and to foster an exchange of ideas concerning Christianity. In bible talks we look at scripture and Biblical principles to understand how these teachings can be applied to daily life, and we discuss issues of faith, reason, and spirituality.</span></p>\r\n<p><span style=\"font-weight: 400;\">These bible talks are open to anyone, with any level of interest or previous knowledge about God or no knowledge at all.</span></p>\r\n<p><span style=\"font-weight: 400;\">In John 13:34-35 Jesus teaches:</span></p>\r\n<p><span style=\"font-weight: 400;\">&ldquo;A new command I give you: love one another. As I have loved you, so you must love one another. By this all men will know that you are my disciples, if you love one another.&rdquo;</span></p>\r\n<p><span style=\"font-weight: 400;\">Because of this teaching we try to create a strong family bond in our group, through both spiritual, social, and service based events. We are devoted to each other and to the campus community at large, doing our best to live lives of love.</span></p>",
        "Summary": "We are a diverse family of students from all majors and years who are committed to living a lifestyle impacted by the teachings of Jesus Christ. We strive for open communication and deep lasting relationships that draw us closer to God and to each other.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Religious & Spiritual Council"
        ]
    },
    {
        "Name": "Alpha Phi Alpha Fraternity Incorporated; Alpha Kappa Chapter",
        "Description": "<p>On December 4th, 1906, Seven collegiate men at Cornell University founded Alpha Phi Alpha Fraternity, Inc. It has supplied voice and vision to the struggle of African-Americans and people of color around the world.</p>\r\n<p>Alpha Phi Alpha, the first intercollegiate Greek-letter fraternity established for African-Americans, was founded at Cornell University in Ithaca, New York by seven college men who recognized the need for a strong bond of Brotherhood among African descendants in this country. The visionary founders, known as the \"Jewels\" of the Fraternity, are Henry Arthur Callis, Charles Henry Chapman, Eugene Kinckle Jones, George Biddle Kelley, Nathaniel Allison Murray, Robert Harold Ogle, and Vertner Woodson Tandy.</p>\r\n<p>&nbsp;</p>\r\n<p>The Fraternity initially served as a study and support group for minority students who faced racial prejudice, both educationally and socially, at Cornell. The Jewel founders and early leaders of the Fraternity succeeded in laying a firm foundation for Alpha Phi Alpha's principles of scholarship, fellowship, good character, and the uplifting of humanity.</p>\r\n<p>&nbsp;</p>\r\n<p>Alpha Phi Alpha chapters were developed at other colleges and universities; many of them historically black institutions, soon after the founding at Cornell. While continuing to stress academic excellence among its members, Alpha also recognizes the need to help correct the educational, economic, political, and social injustices faced by African-Americans.</p>\r\n<p>&nbsp;</p>\r\n<p>Alpha Phi Alpha has long stood at the forefront of the African-American community's fight for civil rights through leaders such as: W.E.B. Dubois, Adam Clayton Powell, Jr., Edward Brooke, Martin Luther King, Jr., Thurgood Marshall, Andrew Young, William Gray, Herbert Hoover, and many others.</p>\r\n<p>&nbsp;</p>",
        "Summary": "Since its founding on December 4, 1906, Alpha Phi Alpha Fraternity, Inc. has supplied voice and vision to the struggle of African-Americans and people of color around the ",
        "CategoryNames": [
            "Registered Student Organizations",
            "National Pan-Hellenic Council",
            "Greek Life - Fraternity "
        ]
    },
    {
        "Name": "Alpha Phi Omega",
        "Description": "<p>Alpha Phi Omega is a national co-educational community service fraternity founded on the principles of leadership, friendship, and service. We are the largest collegiate service organization in the nation, with almost 700 chapters in the United States!</p>\r\n<p>The Kappa Omicron chapter at UMass Amherst was founded in 1952 and has been active ever since. There are currently about 100 active members as well as many alumni in the&nbsp; area who are all passionate about making an impact through servant leadership.&nbsp;APO is perfect for people who want to participate in exciting, and rewarding community service, meet great friends, and strengthen their leadership skills!</p>",
        "Summary": "National co-ed community service fraternity based on the principals of leadership, friendship, service. Interested in participating in our exciting and rewarding community service program, and meeting new friends? Email rushapoko@gmail.com for more info!",
        "CategoryNames": [
            "Registered Student Organizations",
            "Greek Affiliated Council"
        ]
    },
    {
        "Name": "Alpha Tau Gamma",
        "Description": "<p>The fraternal brotherhood of Alpha Tau Gamma is the academic, service, and social fraternity of the Stockbridge School of Agriculture at the University of Massachusetts, Amherst. Founded in 1919, ATG has provided Stockbridge men with an avenue for professional growth and development through a long-standing tradition of service to the University and local communities as well as providing an environment for students to excel in their respective studies. ATG has developed into a strong band of brothers through the hard work and determination of the alumni and active chapter.</p>",
        "Summary": "The fraternal brotherhood of Alpha Tau Gamma is the academic, service, and social fraternity of the Stockbridge School of Agriculture at the University of Massachusetts, Amherst. Founded in 1919, ATG has provided Stockbridge men with an avenue for",
        "CategoryNames": [
            "Registered Student Organizations",
            "Interfraternity Council",
            "Greek Life - Fraternity "
        ]
    },
    {
        "Name": "Alpine Ski Team",
        "Description": "<p>The UMass Alpine Ski Team competes in the MacConnell Division of the United States Collegiate Ski Association, with the goal of winning the USCSA National Championships.&nbsp;</p>\r\n<p>We aim to foster leadership and teamwork, on- and off-snow, through hard work and dedication to the team and sport of skiing. We also work to fundraise and create opportunities for our organization within the community of Amherst and the ski racing community in general. We aim to foster an environment of independence and accountability during their time on the team and throughout the rest of their lives.&nbsp;</p>",
        "Summary": "The UMass Alpine Ski Team competes in the MacConnell Division of the United States Collegiate Ski Association, with the goal of winning the USCSA National Championships. \r\nWe aim to foster leadership and teamwork, on-snow and off-snow through hard work. ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Club Sport Council "
        ]
    },
    {
        "Name": "ALTITUDE",
        "Description": "<p>-------------------------------------------------------------------<br />Mission Statement:<br />-------------------------------------------------------------------</p>\r\n<p><span style=\"font-weight: 400;\">The goal of UMass ALTITUDE, formerly UMass Hip-Hop Culture Organization, is to spread the positive aspects of dance. We strive to be an inclusive community whose focus has grown to explore varying genres of dance within the Five College and Greater Boston area.</span></p>\r\n<p>&nbsp;</p>\r\n<p><em><span style=\"font-weight: 400;\">What We Do</span></em></p>\r\n<p><span style=\"font-weight: 400;\">As an organization we value self-expression, creativity, and a sense of community. We strongly believe in every individual having the capability to dance</span> <span style=\"font-weight: 400;\">if they are willing to learn. We hold dance workshops choreographed by student and guest choreographers from the Boston Area. In addition, we offer open practices at the UMass Rec Center for students to explore diverse dance styles. We also provide a space at the Integrative Learning Center to teach students about breaking. We want to give students the opportunity to connect with others in the dance community.&nbsp;</span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">In addition to holding workshops and events, Altitude</span><em><span style=\"font-weight: 400;\">&nbsp;</span></em><span style=\"font-weight: 400;\">proudly produces the performance team, 5:Dirty Crew. 5:Dirty Crew is an audition-based group that holds weekly practices for their members. Throughout the year, 5:Dirty Crew performs at events within UMass Amherst, the 5-College Area, and the Greater Boston area. The crew has grown exponentially in the past couple of years and continues to recruit dancers of all backgrounds and experiences, giving their members a platform to grow together as dancers and individuals. Auditions for the performance team are held at the beginning of each semester.&nbsp;</span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">All levels of dance experience are welcomed and encouraged to attend events and audition for the performance team.&nbsp;</span></p>\r\n<p><br /><br /></p>\r\n<p><em><span style=\"font-weight: 400;\">Our History</span></em></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">Originally, we were a group of breakers and freestylers who embodied the hip-hop culture of bboying. They were known for practicing at the Integrative Learning Center and were soon joined by more dancers that didn&rsquo;t come from breaking. The space transitioned from a place solely for breaking to one welcoming dancers of varying styles. With the idea of creating a group dedicated to allowing individuals the ability to choreograph and showcase their talents, a performance team was formed.&nbsp;</span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">The name, 5:Dirty Crew, pays tribute to the dancers who practiced at 5:30 everyday. The crew was made up of breakers and dancers that performed their own choreography, looking to create a welcoming community of dancers who loved to dance and perform.&nbsp;</span></p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-weight: 400;\">While&nbsp;Altitude&nbsp;</span><span style=\"font-weight: 400;\">once started as a group of friends who shared the same passion for breaking, we have grown into an organization whose hope is to build a strong sense of community that revolves around all genres of dance. From hosting workshops to creating 5:Dirty Crew and much more, we strive to give everyone and anyone, regardless of experience and background, the chance to enjoy and grow through dance.&nbsp;&nbsp;</span></p>",
        "Summary": "The goal of the UMass ALTITUDE is to spread the positive aspects of dance. We strive to be an inclusive community whose focus has grown to explore varying genres of dance within the Five College and Greater Boston area.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Arts & Media Council"
        ]
    },
    {
        "Name": "American Association of Petroleum Geologists Student Chapter",
        "Description": null,
        "Summary": "We are a group of geoscience majors looking to gain additional knowledge and experience outside the classroom by learning from individual chapter members and professional speakers.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Chemical Society",
        "Description": "<p>The UMass student chapter of the American Chemical Society helps chemistry students develop&nbsp;academic and professional skills vital to careers in chemistry and related fields. We provide networking opportunities and promote chemistry in the local community through outreach efforts, as well as talks at local and national conferences. We hope to develop an inclusive community for students interested in chemistry.</p>\r\n<p>WE MEET TUESDAY 7-8 PM (EVERY OTHER WEEK)</p>",
        "Summary": "UMass ACS is the the student chapter of the American Chemical Society at the University of Massachusetts Amherst.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Heart Association",
        "Description": null,
        "Summary": "The American Heart Association Chapter at the University of Massachusetts Amherst  ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Advocacy Council"
        ]
    },
    {
        "Name": "American Hotel and Lodging Association",
        "Description": "<p>The American Hotel &amp; Lodging Association<span class=\"x_x_Apple-converted-space\">&nbsp;</span>strives to provide club members with the opportunity to gain insights into the hotel industry by creating opportunities to network with industry professionals and conducting site visits to hotels and industry functions. Through interactive learning and hands-on experiences, members can develop a network of both professional and academic connections.</p>\r\n<p>For the most up-to-date information, please visit: www.ahla-umassamherst.com or check out the AHLA Instagram</p>",
        "Summary": "AH&LA strives to gain insights into the hotel industry by creating interactions with industry professionals and by conducting site visits.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Institute of Aeronautics and Astronautics (AIAA)",
        "Description": null,
        "Summary": "N/a",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Institute of Architecture Students",
        "Description": "<p>AIAS UMass is a chapter of the national American Institute of Architecture Students. We represent the campus population of architecture &amp; design students.</p>\r\n<p>The mission of AIAS is to advance leadership, design and service among architecture students.</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-family: arial,helvetica,sans-serif;\">Email: umassamherst@aias.org</span></p>\r\n<p><span style=\"font-family: arial,helvetica,sans-serif;\">Slack:&nbsp;<a href=\"https://umassaias.slack.com/archives/C045SLRM32Q\">https://umassaias.slack.com/archives/C045SLRM32Q</a>&nbsp;</span></p>\r\n<p><span style=\"font-family: arial,helvetica,sans-serif;\">Instagram:&nbsp;<a href=\"https://www.instagram.com/aiasumass/\">https://www.instagram.com/aiasumass/</a></span></p>\r\n<p>&nbsp;</p>",
        "Summary": "AIAS UMass represents UMass architecture and design students.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Marketing Association",
        "Description": null,
        "Summary": "The American Marketing Association (AMA) UMass Amherst Chapter is a student-run organization affiliated with the world's leading professional marketing association. Our club is open to students of all majors, interests, and backgrounds.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Medical Student Association (AMSA)",
        "Description": "<p>The American Medical Student Association (AMSA), with a half-century history of medical student activism, is the oldest and largest independent association of physicians-in-training in the United States.</p>\r\n<p>Today, AMSA is a student-governed, national organization committed to representing the concerns of physicians-in-training. AMSA members are medical students, premedical students, interns, residents and practicing physicians. Founded in 1950, AMSA continues its commitment to improving medical training and advocacy for the nation&rsquo;s health.</p>\r\n<p>At AMSA, advocacy is a way of life. Student idealism is transformed into meaningful public service, innovation and institutional change. At this premedical chapter, AMSA's mission is to educate future physicians and other health professionals in medical fields that are of high importance. This education is aimed to instill traits of advocacy and activism.</p>",
        "Summary": "The American Medical Student Association (AMSA) is the oldest and largest independent association of physicians-in-training in the United States.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Red Cross Club of UMass Amherst",
        "Description": "<p>At the UMass Red Cross Club, our goal is to make a difference on campus by helping&nbsp;people. Each blood transfusion can save up to three lives, and that's our motivation behind volunteering countless hours and recruiting donors&nbsp;for&nbsp;the American Red Cross.&nbsp;<br /><br />We are on <a href=\"https://www.facebook.com/UMassRedCross\">Facebook</a>&nbsp;where&nbsp;you can&nbsp;see a whole list of events for each semester, including blood drives and our group meetings throughout the semester.<br /><br />To become a part of the club, join us on <strong>Campus Pulse</strong>, Like us on <strong>Facebook</strong> and Email <strong>umassredcrossclub@gmail.com&nbsp;</strong>to join our mailing list. &nbsp;Numerous emails regarding philanthropy and fundraising events will be sent along with other pertinent club updates.</p>\r\n<p>Please understand that we require each club member&nbsp;to regularly volunteer at our numerous&nbsp;blood drives (not Spring '16), fundraising events, and philanthropy events throughout the year in order to remain an active member.</p>\r\n<p>You will&nbsp;be required to:</p>\r\n<ol>\r\n<li>Tape flyers around campus.</li>\r\n<li>Table at Dining Halls/Campus Center to promote early blood donor appointments for upcoming drives.</li>\r\n<li>Work during a blood drive - either working the sign-in desk or canteen.</li>\r\n<li>Come to informational/educational events.</li>\r\n<li>Join in on community building events.</li>\r\n<li>Fundraise!</li>\r\n</ol>\r\n<p>We hope you join us and look forward to meeting you at our&nbsp;upcoming meeting!</p>\r\n<p>The UMass Red Cross Club upholds the mission statement of the American Red Cross, \"The American Red Cross prevents and alleviates human suffering in the face of emergencies by mobilizing the power of volunteers and the generosity of donors.\" Members of the UMass Amherst Chapter do this by participating in ​service trips abroad and to give back to communities that are in need. The members also participate locally, by attending the soup kitchen, Not Bread Alone, on a monthly basis. Members also volunteer their time by checking in blood donors at blood drives in order to alleviate the workload of the nursing staff and help run the drives efficiently for all parties involved.</p>",
        "Summary": "The UMass Red Cross Club are a group of student volunteers that coordinate, promote, and recruit donors for all upcoming blood drives on the UMass campus. \r\nVolunteers are responsible for managing Sign-In and Canteen at our campus blood drives.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Service & Engagement Council"
        ]
    },
    {
        "Name": "American Society for Engineering Management Student Chapter",
        "Description": null,
        "Summary": "n/a",
        "CategoryNames": [
            "Graduate Student Organizations"
        ]
    },
    {
        "Name": "American Society of Civil Engineers",
        "Description": "<p>The American Society of Civil Engineers is a group of 100+ civil engineering students that participate in a variety of professional, social and community service events. Each month, we sponsor a meeting with a short presentation from an outside professional and free pizza for all attendees. We participate in intercollegiate design competitions, like the Concrete Canoe, Steel Bridge, and Seismic Design competitions. We host community service events including Habitat for Humanity, Holiday Food Drive, and Relay for Life. Our members play on intramural teams, go on construction field trips, tailgate UMass football and hockey games and attend career fairs and other professional development activities.</p>",
        "Summary": "The American Society of Civil Engineers is a group of 100+ civil engineering students that participate in a variety of professional, social and community service events. Each month, we sponsor a meeting with a short presentation from an outside ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Society of Landscape Architects",
        "Description": "<p>We represent the Boston Student Chapter of the larger American Society of Landscape Architects</p>",
        "Summary": "Landscape Architects",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "American Society of Mechanical Engineers",
        "Description": null,
        "Summary": "The objective of this club is to promote mentorship, entrepreneurship, and innovative research to Mechanical Engineering students. The society seeks to serve as a liaison between engineering students, faculty, and graduates in the field.",
        "CategoryNames": [
            "Registered Student Organizations",
            "Academic Council"
        ]
    },
    {
        "Name": "Amherst Community Kitchen",
        "Description": "<p>The UMASS Amherst Community Kitchen helps meet hunger and nutritional needs of those less fortunate individual's in our Amherst Community. We are comprised of UMASS student volunteers and some community volunteers to go into to the community and be the \"middle men\" between local farms and businesses and food distribution agents within the community.</p>\r\n<p>We run two large scale can drives one in the Fall called Mnutemen Fighting Hunger and another in the Spring called Sam's Food Fight. These can drives help supplement the Amherst Survival Center and The Western Massachusetts Food Bank.</p>",
        "Summary": "The UMASS Amherst Community Kitchen is a groundbreaking initiative that brings together student and the community to combat hunger. We put students in a place to succeed. Focusing on leadership development, we give students the tools to make a diffrence!",
        "CategoryNames": [
            "Registered Student Organizations",
            "Service & Engagement Council"
        ]
    },
    {
        "Name": "Amnesty International",
        "Description": "<p>With this RSO, we plan to raise awareness through social media, hosting creative events, bringing guest speakers, documentary and movie screenings, and attending pertinent events held by the larger Amnesty International Chapter.</p>",
        "Summary": "Amnesty International is a human rights NGO. Our club is a chapter of this organization and our objective as a group is to prevent world-wide poverty and human rights violations by raising awareness and fundraising for several third world nations. ",
        "CategoryNames": [
            "Registered Student Organizations",
            "Advocacy Council"
        ]
    }
]